package com.dedoxyribose.library.repository.news

import com.dedoxyribose.library.model.News
import kotlinx.coroutines.delay
import org.joda.time.DateTime
import javax.inject.Inject

class NewsRepository @Inject constructor() : INewsRepository {
    override suspend fun getNews(): List<News> {
        delay(1200)
        return mockDataList
    }

    private val mockDataList = listOf(
        News(
            id = 0,
            title = "С благодарностью старому году, с надеждой к новому...",
            subtitle = "Дорогие друзья! Уважаемые читатели!",
            text = "Новый год – это особый праздник! " +
                    "В этот день по нашей планете самым законным образом шагает сказка. " +
                    "Она приносит нам надежду, дарит множество подарков, " +
                    "заставляет надеяться на лучшее! С этой надеждой в душе, " +
                    "мы прощаемся с годом уходящим и встречаем грядущий 2020-й!!!",
            views = 34,
            date = DateTime.parse("2019-12-27T13:31:00")
        ),
        News(
            id = 1,
            title = "Цветоводство – занятие для тех, кто хочет быть счастливым",
            subtitle = null,
            text = "Красивые, яркие, торжественные и благоухающие цветы всегда привлекали " +
                    "человека. Они становятся участниками и радостных, и печальных событий," +
                    " помогают выразить настроение, чувства, вдохновляют и заставляют творить. " +
                    "Цветов в мире великое множество. Гордые гладиолусы, нежные орхидеи и простые" +
                    " ромашки. У каждого цветка свой неповторимый аромат, свои особые очертания, " +
                    "свой набор красок для хрупких лепестков. И у каждого из них – своя история" +
                    " и свои тайны. Тысячелетиями люди пытались найти объяснение этому настоящему " +
                    "живому чуду. Каждый любит цветы по-своему, кто-то просто созерцает, а кто-то" +
                    " выращивает их у себя на клумбах.",
            views = 28,
            date = DateTime.parse("2022-09-27T16:15:00")
        ),
    )
}
